leetcode_1359_count_all_valid_pickup_and_delivery_options.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1359. Count All Valid Pickup and Delivery Options</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1359. Count All Valid Pickup and Delivery Options</h1>
<ul class="org-ul">
<li><a href="how_can_we_extend_the_solution_for_i_to_i_1.html#ID-45B9F3C8-D007-4980-95EF-4361906245A8">How can we extend the solution for \(i\) to \(i+1\)?</a>  Select the order to pick and when it will be delivered.  To delivery the rest of order, we have the solve the same problem with less one order.  Time complexity is \(O(n)\) and space is \(O(1)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">countOrders</span>(<span style="font-weight: bold;">self</span>, n: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        MOD = 10**9 + 7
        <span style="font-weight: bold; font-style: italic;">ans</span> = 1
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(2, n + 1):
            <span style="font-weight: bold; font-style: italic;">ans</span> = ((i * (2 * i - 1) % MOD) * ans) % MOD
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().countOrders(1) == 1
<span style="font-weight: bold;">assert</span> Solution().countOrders(2) == 6
<span style="font-weight: bold;">assert</span> Solution().countOrders(3) == 90
</pre>
</div>
</div>
</body>
</html>